InformationRegisters/ДанныеВизитаЮклайнс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеВизитаЮклайнс</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоследняяДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОплатыВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID_Визита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Мастера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Клиента_ЮК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЮклайнсДанныеСервер/Ext/Module.bsl
// Обновляет запись регистра сведений ДанныеВизита с использованием переданных параметров.
//
// Параметры:
//   СтруктураПараметров - Структура - данные для обновления записи регистра. Содержит ключи:
//     * ID_Визита - идентификатор визита
//     * ID_Мастера - идентификатор мастера
//   При ошибке записи данные логируются в РегистрыСведений.ОчередьИнтеграции
Процедура ОбновитьДанныеВизита(СтруктураПараметров) Экспорт
	
	Менеджер = РегистрыСведений.ДанныеВизитаЮклайнс.СоздатьМенеджерЗаписи();
	Менеджер.ID_Визита = СтруктураПараметров.ID_Визита;
	Менеджер.ID_Мастера = СтруктураПараметров.ID_Мастера;
	
	Менеджер.Прочитать(); 

	Менеджер.ID_Визита = СтруктураПараметров.ID_Визита;
	Менеджер.ID_Мастера = СтруктураПараметров.ID_Мастера;

	ЗаполнитьЗначенияСвойств(Менеджер, СтруктураПараметров);
	
	Попытка
		Менеджер.Записать();
	Исключение
		ДанныеЛога = Новый Структура("Объект, Сообщение, ДопДанные", РегистрыСведений.ОчередьИнтеграции.Метаданные().Имя, "Ошибка в записи РС ДанныеВизита", ОписаниеОшибки());
		ЛогированиеПриложений.Ошибка("ОбновитьДанныеВизита.Ошибка", ДанныеЛога);
	КонецПопытки;
	
КонецПроцедуры

// Возвращает мастера по идентификатору визита в ЮК.линс
//
// Параметры:
//   ID_Визита_ЮК - Строка, Число - идентификатор визита в системе ЮК.линс
//
// Возвращаемое значение:
//   СправочникСсылка.Мастера - ссылка на мастера, связанного с визитом
//   - Неопределено - если визит с указанным идентификатором не найден
Функция ПолучитьМастераИзВизита(ID_Визита_ЮК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1

	|	Визиты.ID_Мастера КАК ID_Мастера_ЮК
	|ИЗ
	|	РегистрСведений.ДанныеВизитаЮклайнс КАК Визиты

	|ГДЕ
	|	Визиты.ID_Визита = &ID_Визита";
	
	Запрос.УстановитьПараметр("ID_Визита", ID_Визита_ЮК);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Мастера.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	МастерСсылка = Справочники.Мастера.НайтиПоРеквизиту("ID_YClients", Выборка.ID_Мастера_ЮК);
	
	Возврат МастерСсылка;
	
КонецФункции
